app/controllers/home_controller.rb

  def index
  	@stories = Story.find_latest_news
---
SELECT * FROM "stories" ORDER BY title