app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "hashed_password", "created_at") VALUES('dave', '696948800.294847036070891', '2010-01-14 21:36:47', '7421d43afdbf6bea3d57e13c6fc12e917096427d', '2010-01-14 21:36:47')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
UPDATE "users" SET "name" = 'admin', "updated_at" = '2010-01-15 00:19:58' WHERE "id" = 3

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE "id" = 1