app/controllers/work_groups_controller.rb

SELECT * FROM "stories" ORDER BY title
---
  def index
  	@stories = Story.find_latest_news